"""
ออกแบบโปรแกรมคำนวณค่าดัชนีมวลกาย BMI (Body Mass Index) โดยรับข้อมูลจากผู้ใช้งานสองค่าคือ น้ำหนัก และ ส่วนสูง โดยใช้สูตร น้ำหนัก / ( (ส่วนสูง/100) ยกกำลัง 2 )

	- ค่าที่ได้น้อยกว่า 18.5 ให้แสดงข้อความว่า “คุณผอมเกินไป”
	- ค่าที่ได้อยู่ระหว่าง 18.5-24.9 ให้แสดงข้อความว่า “คุณอยู่เกณฑ์เหมาะสม นํ้าหนักตัวปกติ”
	- ค่าที่ได้อยู่ระหว่าง 25-29.9 ให้แสดงข้อความว่า “คุณนํ้าหนักเกิน แต่ยังไม่เรียกว่าอ้วน”
	- ค่าที่ได้อยู่ระหว่าง 30-39.9 ให้แสดงข้อความว่า “คุณอ้วนแล้ว !”
	- ค่าที่ได้มากกว่าหรือเท่ากับ 40 ให้แสดงข้อความว่า “คุณอ้วนเกินไป อันตรายมาก !!!”
"""


### bmi = weight / (height/100) ** 2
weight = int(input("Enter weight : "))
height = int(input("Enter height : "))
bmi = weight / (height/100) ** 2
if bmi >= 40:
    print("คุณอ้วนเกินไป อันตรายมาก !!!")
elif bmi >= 30 and bmi <= 39.9 :
    print("คุณอ้วนแล้ว")
elif bmi >= 25 and bmi <= 29.9 :
    print("คุณนํ้าหนักเกิน แต่ยังไม่เรียกว่าอ้วน")
elif bmi >= 18.5 and bmi <= 24.9 :
    print("คุณอยู่เกณฑ์เหมาะสม นํ้าหนักตัวปกติ")
else:
    print("คุณผอมเกินไป")